var activityDetails=`
{
    "0": {
      "1": {
        "Activity": "NA"
      },
      "2": {
        "Activity": "NA"
      },
      "3": {
        "Activity": "NA"
      },
      "4": {
        "Activity": "NA"
      }
    },
    "1": {
      "1": {
        "Activity": "NA"
      },
      "2": {
        "Activity": "NA"
      },
      "3": {
        "Activity": "NA"
      },
      "4": {
        "Activity": "NA"
      }
    },
    "2": {
      "1": {
        "Activity": "NA"
      },
      "2": {
        "Activity": "NA"
      },
      "3": {
        "Activity": "NA"
      },
      "4": {
        "Activity": "AES\/JE-से बचाव के बारे में जानकारी"
      }
    },
    "3": {
      "1": {
        "Activity": "फोकल शिक्षकों का चयन, कक्षावार बाल प्रेरकों का चयन"
      },
      "2": {
        "Activity": "विद्यालय आपदा प्रबंधन समिति का गठन\/पुनर्गठन"
      },
      "3": {
        "Activity": "हजार्ड हंट"
      },
      "4": {
        "Activity": "अगलगी से खतरे एवं बचाव के बारे में जानकारी"
      }
    },
    "4": {
      "1": {
        "Activity": "हजार्ड हंट के परिणाम की प्रस्तुति एवं इससे संबंधित कार्यों का निष्पादन तथा विद्यालय आपदा प्रबंधन योजना का सूत्रण"
      },
      "2": {
        "Activity": "विद्यालय आपदा प्रबंधन योजना का निर्माण संशोधन"
      },
      "3": {
        "Activity": "बज्रपात (ठनका ) चक्रवर्ती तूफान आंधी से खतरे एवं इसके उपाय के बारे में जानकारी"
      },
      "4": {
        "Activity": "अगलगी लू से खतरे एवं बचाव के संदर्भ में जानकारी"
      }
    },
    "5": {
      "1": {
        "Activity": "अपने गाँव के बच्चों के साथ गाँव /टोले/मोहल्ले का बाल सुरक्षा समिति के मदद से हजार्ड हंट"
      },
      "2": {
        "Activity": "अवकाश के दौरान हजार्ड हंट अगलगी से बचाव का अभ्यास"
      },
      "3": {
        "Activity": "अवकाश के दौरान हजार्ड हंट एवं लू/गरम हवा, वज्रपात से बचाव का अभ्यास "
      },
      "4": {
        "Activity": "अवकाश के दौरान अपने गाँव के बच्चें के साथ गाँव/टोले का हजार्ड हंट एवं आपदा प्रबंधन योजना का निर्माण "
      }
    },
    "6": {
      "1": {
        "Activity": "विद्यालय सुरक्षा पखवारा एवं विद्यालय सुरक्षा दिवस का आयोजन"
      },
      "2": {
        "Activity": "विद्यालय सुरक्षा अखवारा का आयोजन"
      },
      "3": {
        "Activity": "वज्रपात  से बचाव की जानकारी"
      },
      "4": {
        "Activity": "बाढ़ से बचाव हेतु कौशल विकास एवं प्रशिक्षण तथा अभ्यास (मॉकड्रिल)"
      }
    },
    "7": {
      "1": {
        "Activity": "पेयजल की अशुद्धता से होने वाले खतरे एवं उसके उपाय के बारे में जानकारी "
      },
      "2": {
        "Activity": "बाढ़ से खतरे एवं बचाव के उपाय , कौशल विकास एवं प्रशिक्षण तथा अभ्यास (माॅकड्रिल) "
      },
      "3": {
        "Activity": "साँप - बिच्छू एवं अन्य विषैले जीव- जन्तुओं के काटने से होनेवाली परशानियाँ एवं समाधन के संदर्भ में जानकारी "
      },
      "4": {
        "Activity": "नाव दुर्घटना एवं पानी में डूबने से बचाव के संदर्भ में जानकारी "
      }
    },
    "8": {
      "1": {
        "Activity": "डायरिया के संबंध में जानकारी तथा ओ•आर•एस• बनाने के संबंधित कौशल प्रशिक्ष एवं अभ्यास "
      },
      "2": {
        "Activity": "रेल/ सड़क दुर्घटना से बचाव के संदर्भ में जानकारी"
      },
      "3": {
        "Activity": "भूकंप से खतरे एवं बचाव के बारे में जानकारी (माॅकड्रिल) "
      },
      "4": {
        "Activity": "बाल अधिकार, बाल विवाह, बाल शोषण तथा बच्चों से छेड़छाड़ के संदर्भ में जानकारी "
      }
    },
    "9": {
      "1": {
        "Activity": "दशहरा /छठ पूजा/मुहर्रम आदि पर्वों में भीड़ एवं भगदड़ संबंधी जोखिम एवं बचाव (प्राथमिक उपचार, C.P.R. सहित) "
      },
      "2": {
        "Activity": "नाव दुर्घटना एवं पानी में डूबने से बचाव के संदर्भ में जानकारी "
      },
      "3": {
        "Activity": "दिवाली के पटाखों एवं प्रदूषण से उत्पन्न स्वास्थ्य संबंधी जोखिम एवं बचाव के संदर्भ में जानकारी "
      },
      "4": {
        "Activity": "सड़क दुर्घटना से बचाव के संदर्भ में जानकारी "
      }
    },
    "10": {
      "1": {
        "Activity": "NA"
      },
      "2": {
        "Activity": "NA"
      },
      "3": {
        "Activity": "NA"
      },
      "4": {
        "Activity": "NA"
      }
    },
    "11": {
      "1": {
        "Activity": "NA"
      },
      "2": {
        "Activity": "NA"
      },
      "3": {
        "Activity": "NA"
      },
      "4": {
        "Activity": "NA"
      }
    }
  }
  
`