var calenderData=`
{
    "01/17/2024": {
      "Holiday": "गुरु गोविन्द सिंह जयंती",
      "Column3": 1
    },
    "01/26/2024": {
      "Holiday": "गणतंत्र दिवस",
      "Column3": 2
    },
    "02/14/2024": {
      "Holiday": "बसंत पंचमी",
      "Column3": 2
    },
    "02/24/2024": {
      "Holiday": "संत रविदास जयंती",
      "Column3": 3
    },
    "02/26/2024": {
      "Holiday": "शब्-ए-बारात",
      "Column3": 4
    },
    "03/08/2024": {
      "Holiday": "महाशिवरात्रि",
      "Column3": 4
    },
    "03/22/2024": {
      "Holiday": "बिहार दिवस",
      "Column3": 5
    },
    "03/26/2024": {
      "Holiday": "होली",
      "Column3": 6
    },
    "03/27/2024": {
      "Holiday": "होली",
      "Column3": 7
    },
   
   
    "04/11/2024": {
      "Holiday": "ईद उल फितर",
      "Column3": 10
    },
   
    "04/14/2024": {
      "Holiday": "आंबेडकर जयंती",
      "Column3": 12
    },
    "04/15/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 13
    },
    "04/16/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 14
    },
    "04/17/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 15
    },
    "04/18/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 16
    },
    "04/19/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 17
    },
    "04/20/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 18
    },
    "04/21/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 19
    },
    "04/22/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 20
    },
    "04/23/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 21
    },
    "04/24/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 22
    },
    "04/25/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 23
    },
    "04/26/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 24
    },
    "04/27/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 25
    },
    "04/28/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 26
    },
    "04/29/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 27
    },
    "04/30/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 28
    },
    "05/01/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 29
    },
    "05/02/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 30
    },
    "05/03/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 31
    },
    "05/04/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 32
    },
    "05/05/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 33
    },
    "05/06/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 34
    },
    "05/07/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 35
    },
    "05/08/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 36
    },
    "05/09/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 37
    },
    "05/10/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 38
    },
    "05/11/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 39
    },
    "05/12/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 40
    },
    "05/13/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 41
    },
    "05/14/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 42
    },
    "05/15/2024": {
      "Holiday": "ग्रीष्मावकाश",
      "Column3": 42
    },
    "05/17/2024": {
      "Holiday": "जानकी नवमी",
      "Column3": 42
    },
    "05/23/2024": {
      "Holiday": "बुद्ध पूर्णिमा",
      "Column3": 43
    },
    
    "06/18/2024": {
      "Holiday": "बकरीद",
      "Column3": 44
    },
    
    "06/22/2024": {
      "Holiday": "कबीर जयंती",
      "Column3": 47
    },
    
    "07/18/2024": {
      "Holiday": "मुहर्रम",
      "Column3": 49
    },
    "08/15/2024": {
      "Holiday": "स्वतंत्रता दिवस",
      "Column3": 50
    },
    "08/25/2023": {
      "Holiday": "चेहल्लुम",
      "Column3": 51
    },
    "08/26/2024": {
      "Holiday": "श्री कृष्ण जन्माष्टमी",
      "Column3": 56
    },
    "09/16/2024": {
      "Holiday": "हजरत मुहम्मद जन्म दिवस",
      "Column3": 52
    },
    "10/10/2024": {
      "Holiday": "दुर्गा पूजा सप्तमी",
      "Column3": 53
    },
    "10/11/2024": {
      "Holiday": "दुर्गा पूजा",
      "Column3": 54
    },
    "10/12/2024": {
      "Holiday": "दुर्गा पूजा",
      "Column3": 55
    },
    "10/31/2024": {
      "Holiday": "दीपावली",
      "Column3": 56
    },
    "11/03/2024": {
      "Holiday": "भाई दूज",
      "Column3": 56
    },
    "11/07/2024": {
      "Holiday": "छठ पूजा",
      "Column3": 57
    },
    "11/08/2024": {
      "Holiday": "छठ पूजा",
      "Column3": 58
    },
    "11/09/2024": {
      "Holiday": "छठ पूजा",
      "Column3": 59
    },
    "12/25/2024": {
      "Holiday": "क्रिसमस",
      "Column3": 60
    }
  }
`

var calenderDetailed=`
{
  "January": [
      {
          "Date": "2024-01-17",
          "Holiday": "गुरु गोविन्द सिंह जयंती",
          "Column3": 1
      },
      {
          "Date": "2024-01-26",
          "Holiday": "गणतंत्र दिवस",
          "Column3": 2
      }
  ],
  "February": [
      {
          "Date": "2024-02-24",
          "Holiday": "संत रविदास जयंती",
          "Column3": 3
      },
      {
        "Date": "2024-02-14",
        "Holiday": "बसंत पंचमी",
        "Column3": 3
    },
      {
          "Date": "2024-02-26",
          "Holiday": "शब्-ए-बारात",
          "Column3": 4
      }
  ],
  "March": [
     {
      "Date": "2024-03-08",
      "Holiday": "महाशिवरात्रि",
      "Column3": 5
      },
      {
          "Date": "2024-03-22",
          "Holiday": "बिहार दिवस",
          "Column3": 5
      },
      
      {
          "Date": "2024-03-26",
          "Holiday": "होली",
          "Column3": 6
      },
      {
          "Date": "2024-03-27",
          "Holiday": "होली",
          "Column3": 7
      }
      
  ],
  "April": [      
      {
          "Date": "2024-04-11",
          "Holiday": "ईद उल फितर",
          "Column3": 10
      },      
      {
          "Date": "2024-04-14",
          "Holiday": "आंबेडकर जयंती",
          "Column3": 12
      },
      {
          "Date": "2024-04-15",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 13
      },
      {
          "Date": "2024-04-16",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 14
      },
      {
          "Date": "2024-04-17",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 15
      },
      {
          "Date": "2024-04-18",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 16
      },
      {
          "Date": "2024-04-19",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 17
      },
      {
          "Date": "2024-04-20",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 18
      },
      {
          "Date": "2024-04-21",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 19
      },
      {
          "Date": "2024-04-22",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 20
      },
      {
          "Date": "2024-04-23",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 21
      },
      {
          "Date": "2024-04-24",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 22
      },
      {
          "Date": "2024-04-25",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 23
      },
      {
          "Date": "2024-04-26",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 24
      },
      {
          "Date": "2024-04-27",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 25
      },
      {
          "Date": "2024-04-28",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 26
      },
      {
          "Date": "2024-04-29",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 27
      },
      {
          "Date": "2024-04-30",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 28
      }
  ],
  "May": [
      {
          "Date": "2024-05-01",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 29
      },
      {
          "Date": "2024-05-02",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 30
      },
      {
          "Date": "2024-05-03",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 31
      },
      {
          "Date": "2024-05-04",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 32
      },
      {
          "Date": "2024-05-05",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 33
      },
      {
          "Date": "2024-05-06",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 34
      },
      {
          "Date": "2024-05-07",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 35
      },
      {
          "Date": "2024-05-08",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 36
      },
      {
          "Date": "2024-05-09",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 37
      },
      {
          "Date": "2024-05-10",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 38
      },
      {
          "Date": "2024-05-11",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 39
      },
      {
          "Date": "2024-05-12",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 40
      },
      {
          "Date": "2024-05-13",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 41
      },
      {
          "Date": "2024-05-14",
          "Holiday": "ग्रीष्मावकाश",
          "Column3": 42
      },
      {
        "Date": "2024-05-15",
        "Holiday": "ग्रीष्मावकाश",
        "Column3": 42
      },
      {
        "Date": "2024-05-17",
        "Holiday": "जानकी नवमी",
        "Column3": 42
      },
      {
          "Date": "2024-05-23",
          "Holiday": "बुद्ध पूर्णिमा",
          "Column3": 43
      }
  ],
  "June": [
      {
          "Date": "2024-06-18",
          "Holiday": "बकरीद",
          "Column3": 44
      },      
      {
          "Date": "2024-06-22",
          "Holiday": "कबीर जयंती",
          "Column3": 47
      }
  ],
  "July": [
      
      {
          "Date": "2024-07-18",
          "Holiday": "मुहर्रम",
          "Column3": 49
      }
  ],
  "August": [
      {
          "Date": "2024-08-15",
          "Holiday": "स्वतंत्रता दिवस",
          "Column3": 50
      },
      {
        "Date": "2024-08-25",
        "Holiday": "चेहल्लुम",
        "Column3": 50
    },
      {
        "Date": "2024-08-26",
        "Holiday": "श्री कृष्ण जन्माष्टमी",
        "Column3": 50
    }
  ],
  "September": [
      {
          "Date": "2024-09-16",
          "Holiday": "हजरत मुहम्मद जन्म दिवस",
          "Column3": 52
      }
  ],
  "October": [
      {
          "Date": "2024-10-10",
          "Holiday": "दुर्गा पूजा सप्तमी",
          "Column3": 53
      },
      {
          "Date": "2024-10-11",
          "Holiday": "दुर्गा पूजा",
          "Column3": 54
      },
      {
          "Date": "2024-10-12",
          "Holiday": "दुर्गा पूजा",
          "Column3": 55
      },
      {
          "Date": "2024-10-31",
          "Holiday": "दीपावली",
          "Column3": 56
      }
  ],
  "November": [
    {
      "Date": "2024-11-03",
      "Holiday": "भाई दूज",
      "Column3": 57
      },
      {
          "Date": "2024-11-07",
          "Holiday": "छठ पूजा",
          "Column3": 57
      },
      {
          "Date": "2024-11-08",
          "Holiday": "छठ पूजा",
          "Column3": 58
      },
      {
          "Date": "2024-11-09",
          "Holiday": "छठ पूजा",
          "Column3": 59
      }
  ],
  "December": [
      {
          "Date": "2024-12-25",
          "Holiday": "क्रिसमस",
          "Column3": 60
      }
  ]
}

`